[
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbbd"},"id":1,"name":"Coffee","recipe":"Mix milk, coffee, and sweetener together in a glass until sweetener is dissolved.","url":"https://www.youtube.com/watch?v=SM_dqUSJvgk"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbbe"},"id":2,"name":"Tea","recipe":"Heat the water (don't boil). Add tea powder and let it boil.Add elaichi and milk, and heat well (don't boil after adding milk).Add sugar in a serving cup, and pour filtered tea into the cup.","url":"https://www.youtube.com/watch?v=Ze6m-gZg3Y4"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbbf"},"id":3,"name":"Plain Milk","recipe":"Heat the milk in a vessel until the milk boils and the cream of the milk floats. Take a glass, filter the cream of the milk and add 2 tsp of sugar and mix.","url":"https://www.youtube.com/watch?v=WeZCMNB2YO0"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbc0"},"id":4,"name":"Nescafe","recipe":"Add a teaspoon of NESCAFÉ Gold Instant Coffee to your cup. If you like sugar you can add it now.Carefully pour the hot boiled water over the cup contents almost to the top. Stir to ensure coffee and sugar are fully dissolved.Add your milk, cold from the fridge and stir.","url":"https://www.youtube.com/watch?v=PSf5RCbTtyY"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbc1"},"id":5,"name":"Black Coffee","recipe":"Bring water to a boil.Take coffee and sugar in a cup, add little hot water and mix well.Now add more water and mix well. Serve hot.","url":"https://www.youtube.com/watch?v=MjDA9cWWmh4"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbc2"},"id":6,"name":"Black Tea","recipe":"Take some water in a saucepan and add sugar or cubes in water and cook on a medium flame for about two minutes, while stirring occasionally. Now as the water comes to a boil, add tea leaves and keep stirring on medium flame for about two minutes. Now let the water infuse all the goodness from the tea leaves on low flame and cover the lid for about another two minutes. Strain the black tea immediately and enjoy.","url":"https://www.youtube.com/watch?v=IYaCZHoBTjw"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbc3"},"id":7,"name":"Flavoured Tea- Green Tea","recipe":"Boil the drinking water and allow to cool slightly for 2-3 mins, this slightly cooler water will get the best out of your delicate tea leaves. Pour the water onto the teabag to release its delicious aroma. Leave the teabag to infuse for up to 3 minutes. If you like a stronger taste you can brew a little longer but watch out, over brewing can cause bitterness. Remove the teabag and enjoy your deliciously refreshing Lipton Green Tea!","url":"https://www.youtube.com/watch?v=x8lRdm65Eqc"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbc4"},"id":8,"name":"Flavoured TEA- Honey","recipe":"Pour water into a mug. Add honey and heat in the microwave for 1 minute and 30 seconds. Stir in lemon juice, mixing until honey is dissolved, then stir in the sugar.","url":"https://www.youtube.com/watch?v=tZv5TYBfbuM"}
]