[
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbdd"},"id":1,"name":"Cassata","recipe":"Mix currants with Amaretto or rum. Stand while preparing other ingredients. Scoop ice cream into a large bowl and microwave for 40-60 seconds or leave to soften on bench for 10 minutes. Work with a heavy spoon to soften just enough for ingredients to be mixed through (do not allow to thaw fully). Add all other ingredients and work quickly to combine evenly. Return mixture to freezer container or individual moulds, cover and freeze for at least 4 hours. Serve in slices or scoops. If desired, garnish with diced pistachios and spoon around vanilla syrup or maple syrup. Cassata will keep in the freezer for up to 2 months. Do not refreeze if melted. ","url":"https://www.youtube.com/watch?v=Krh2m6O7zrc"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbde"},"id":2,"name":"Mango Madness","recipe":" Place all ingredients(2 large mangos, peeled and cubed (3 cups),2 cups ice cubes, 1/2 cup orange juice, 1& 1/2 teaspoons McCormick® Raspberry Extract,1 teaspoon McCormick® Imitation Rum Extract) in blender container; cover. Blend on high speed until smooth. Serve immediately. Garnish as desired.","url":"https://www.youtube.com/watch?v=kv9Qux0IEno"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbdf"},"id":3,"name":"Peach Passion","recipe":"In a cocktail shaker add 3 oz. Skyy Georgia Peach Vodka, 1/2 oz. passion fruit puree, 1 oz. triple sec and a splash of cranberry juice. Shake vigorously. Strain into a chilled cocktail glass and garnish with a peach slice.","url":"https://www.youtube.com/watch?v=jpFcoCuaFYY"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbe0"},"id":4,"name":"Sizzling Brownie","recipe":"Take all ingredients given for cake(All purpose flour / Maida - 2 tblsp, Cocoa Powder - 1 tblsp, Brown Sugar - 2 tblps, Baking Powder - 1/8 tsp,Milk - 2 to 3 tblsp, Oil - 1 tsp) in a bowl and mix well. Spoon it into a greased microwave safe bowl and microwave on high power for 1 min. Remove and cool for 5 mins. Unmould and keep aside. Melt chocolate in microwave for 1 min. Add cream and mix well. Take sizzle plate and heat the iron plate till smoking. PLace it on the wooden plate. Place brownie over it. Place a scoop of icecream on it. Pour sauce over it and serve.","url":"https://www.youtube.com/watch?v=ngDqanR_1iU"}
]