[
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbd2"},"id":1,"name":"Veg Flat Noodles","recipe":"Into a bowl, add the tamarind water, other pad Thai sauce ingredients and stir well. Add as much or as little Chilli sauce as you prefer, but don't skimp on the sugar (you need it to balance the sourness of the tamarind). Set this Pad Thai sauce mixture aside. Place your wok over medium-high heat. Add a tablespoon of oil plus the garlic and onions. Stir fry for about a minute to release the fragrance. Add the Bok Choy, carrots, bell peppers & broccoli and stir-fry 2 minutes until the vegetables are lightly softened and yet crisp. Stir in the tofu and toss for a fe seconds. Next push the ingredients to the side of the wok and add the drained noodles and 1/3 of the pad thai sauce. Stir-fry everything together for 1 minute using 2 ladles and a tossing motion (like tossing a salad). Add a little more sauce and continue stir-frying in the same way for 1-2 more minutes, or until the noodles begin to soften. Add the bean sprouts plus the remaining sauce. Stir-fry to incorporate everything together into the vegetarian pad thai for 1-3 more minutes, or until noodles are cooked. Noodles are cooked to perfection when they are soft but still deliciously chewy and a little bit sticky. Remove from heat and taste-test, adding more pad thai sauce or soy sauce or chill sauce if desired for more salt or flavor. To serve, scoop noodles onto a serving platter. Sprinkle with the green onion, coriander and peanuts. Add wedges of fresh-cut lime on the side.","url":"https://www.youtube.com/watch?v=h9HmkZlDlzM"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbd3"},"id":2,"name":"Special Noodles","recipe":"To make this easy recipe, begin with par-boiling the noodles. Once done, drain the excess water and keep aside. In the meantime, heat a pan over medium flame. Once the oil is sufficiently hot, add the ginger-garlic paste and fry for some time. If you like to make it more delicious, add some finely chopped green chillies. You can also use chillies soaked in vinegar. Then add the onions, beans and green chillies in the same pan and saute for a minute or two. Add the carrots, cabbage, salt, pepper powder, soy sauce and Ajinomoto. Stir-fry the ingredients for some time. Once done, add the boiled noodles and break the eggs into the pan. Mix well and cook for a few minutes. If you like smoky flavours, stir the veggies mix on a high flame. Cover the pan with a lid and allow it to cook for around 2-3 minutes. Once done, transfer the dish to a serving bowl and garnish with coriander leaves. Serve hot and enjoy with your family and friends. You can also pair Egg Noodles with spicy gravy of your choice.","url":"https://www.youtube.com/watch?v=aQHr9Zsnzbw"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbd4"},"id":3,"name":"Malaysian Noodles","recipe":"Line a plate with a triple layer of paper towels; top with tofu. Place a triple layer of paper towels on top of tofu; top with another plate. Let stand 20 minutes. Cut tofu into 1/2-inch cubes. Cook noodles in a large pan of boiling water 3 minutes or until done; drain in a colander over a bowl, reserving 1 cup cooking liquid. Wipe pan with paper towels. Heat oil in pan over medium heat. Add garlic to pan; cook 30 seconds, stirring constantly. Add salt and bok choy; cook 30 seconds, stirring frequently. Stir in 1/2 cup reserved cooking liquid; bring to a boil. Reduce heat, and cook 4 minutes. Combine sugar and remaining ingredients, stirring until combined. Add noodles, remaining 1/2 cup cooking liquid, and sugar mixture to pan; toss to combine. Cook 30 seconds or until thoroughly heated, tossing to coat. Add tofu; toss to combine. Serve immediately.","url":"https://www.youtube.com/watch?v=MYkPzaBLzP4"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbd5"},"id":4,"name":"Manchurian","recipe":"1. Take the finely chopped or grated veggies in a bowl.  you will need ½ cup finely chopped red cabbage, ½ cup grated carrot, ¼ cup finely chopped capsicum (green bell pepper), ¼ cup finely chopped french beans and ¼ cup finely chopped spring onions. You can also add regular green cabbage instead of red or purple cabbage. Then add the dry ingredients – 2 tablespoons corn starch, 2 tablespoons all purpose flour (maida), ½ teaspoon black pepper and ½ teaspoon salt or add as required. Mix and gather the whole mixture together. Then kind of mix and knead so that the veggies leave the water and you get a dough-like mixture. But do not knead like that a bread or roti dough. Gluten strands can form that will give a dense chewy texture in the fried veggie balls. So just mix very well and press so that the veggies release their juices. Then take a small portion of the mixture in your hands.Press and roll it in your palm and make a round veggie ball. Make all veggie balls this way and keep aside. You can spread some oil on your palms while making the vegetable balls. Heat oil for deep frying in a kadai or pan. Add a small piece of a ball to the hot oil. If the balls does not stick or settle down at the bottom of the pan, but comes up steadily the oil is ready for frying these veggie balls. If the balls break, then some more binding agent is required. So you can add 2 to 3 teaspoons of some more all-purpose flour (maida).Gently place the balls in the hot oil. The oil has to be medium hot. Too much heat and the manchurian balls will be browned from top and uncooked from inside. Less hot oil will make the balls absorb too much oil.When cooked from one side, turn the balls with a slotted spoon.  Fry the balls till crisp and golden turning them over a couple of times. Remove them with a slotted or perforated spoon and drain as much as oil as possible. Place the fried manchurian balls on kitchen paper towels. For a low-fat version, you can cook the veggie balls in an appe-appam pan or æbleskiver pan. Fry the veg balls this way in batches and keep aside. In a small bowl take the following three sauces – ½ tablespoon soy sauce (or 1.5 teaspoons soy sauce), 1 tablespoon tomato ketchup, 2 to 3 teaspoons of red chilli sauce. The red chilli sauce is spicy and not sweet.Mix the sauces very well and keep aside. In another small bowl take 1 tablespoon cornflour (corn starch) and 2 tablespoons water. Mix very well and keep aside. Heat 1 to 1.5 tablespoons oil in a pan or wok. Add 4 tablespoons chopped spring onions (scallions), 1 tablespoon finely chopped ginger, 1 tablespoon finely chopped garlic, 2 green chilies (finely chopped) and ¼ cup finely chopped capsicum (green bell pepper). Adding capsicum is optional. You can use toasted sesame oil or sunflower oil or any neutral tasting oil. Stir fry on medium flame till the onions turn translucent.Now add the mixed sauces.Stir and mix very well. Add 1 to 1.25 cups water. Let the mixture come to a boil. Mix the corn flour paste again in the bowl (as the corn flour settles at the bottom) and then add in the pan. As soon as you add corn flour paste, mix very well so that there are no lumps. Continue to stir and mix when the manchurian gravy is cooking. Simmer till the manchurian sauce thickens and you see a glaze in it. There should be no raw taste of the cornflour in the sauce. Cooking sauce or gravy takes about 3 to 4 minutes on a medium flame. If the sauce is too thick, then you add some water. If it is too thin, then you can add some cornflour. When the manchurian gravy thickens, add ½ teaspoon black pepper powder.Season with a bit of salt. Do keep in mind that the soy sauce, chilli sauce and tomato ketchup already has salt in it. So add less salt and as per your taste preferences. Add ¼ to ½ teaspoon sugar or more if required. Mix very well. hen add the fried vegetable balls. Also add 1 teaspoon rice vinegar or regular vinegar or apple cider vinegar. Gently stir and coat the fried vegetable balls in the gravy.  Switch off the flame and add chopped spring onion greens. Serve Veg Manchurian Gravy hot garnished with some spring onion greens (scallion greens). It goes well with veg fried rice or schezwan fried rice or plain steamed rice or noodles and even bread or roti.","url":"https://www.youtube.com/watch?v=2-uu7l3Qwuo"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbd6"},"id":5,"name":"Schezuan Manchurian","recipe":"Take a mixing bowl, add chopped vegetables, chopped ginger, salt, red chili paste, a pinch of food color, corn flour, Maida/all-purpose flour and mix well. Divide the mixture into equal parts or into small lemon-sized balls and keep aside. Heat oil for deep-frying. When the oil is hot, leave the veg balls one by one carefully into the oil. Fry until they turn nice orange-red color and take them onto a paper towel and keep aside. Mix 1tbsp of corn flour with 1 cup(250 ml) water and keep aside. Heat oil in a pan. Add chopped ginger garlic, spring onion bulbs, capsicum and sauté for a minute. Add a little salt, vinegar, dark soy sauce, black pepper powder, red chili powder, red chili paste and mix well. Add the cornstarch and mix until it starts bubbling. When it starts to bubble, add the fried veg balls, mix well and cook until the gravy disappears. Add finely chopped spring onion before you turn off the flame and serve hot.","url":"https://www.youtube.com/watch?v=HfkXjjrghB8"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbd7"},"id":6,"name":"Corn Bharta","recipe":"1. Grill the whole tomatoes over an open gas flame until the skin is charred and the tomato softens or rrill the tomatoes in an oven for 20 mins. Turn them every 7-8 mins. Allow the tomatoes to cool, then peel and puree them. Grill an onion on the open flame until the skin is charred or it can also be grilled along with the tomatoes in the oven. Once the onion is cool, peel it. Blend it along with garlic and ginger into a smooth puree. Add a little water to help the blending if required. Boil the corn until done. Takes around 4-5 mins in the microwave. Heat oil in a pan and add the cumin seeds. Once the cumin seeds brown slightly, add the onion-ginger-garlic paste and fry until it turns light brown. Add the tomato puree and add the red chilli powder, turmeric powder, cumin powder and coriander powder. Cook until the oil separates or for 8-10 mins on low flame while stirring frequently. Add water to achieve the desired consistency and cook for another 2 mins. Add the salt and corn and simmer for 1 min.  Serve hot with rotis","url":"https://www.youtube.com/watch?v=61uu1tcFx64"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbd8"},"id":7,"name":"Paratha","reciepe":"In a bowl take whole wheat flour. Add salt, oil and water. Mix and then knead into a smooth soft dough. Add more water if required while kneading. Cover and keep the dough aside for 30 minutes. Pinch a medium-sized ball from the dough. Flatten and dust with some flour.With a rolling pin, roll into a circle of about 4 inches diameter. Spread some ghee on the dough circle. Fold in a half. Now spread some ghee on this half folded dough.  Fold sideways and this time you will get a folded triangle. Dust some flour on the folded triangle.  Now begin to roll the folded triangle. Add some flour if required and roll into a circle or triangle of about 6 to 7 inches diameter.Roll a medium-sized ball on a lightly dusted board to a circle of about 4 to 5 inches in diameter. Spread some ghee on the rolled dough. Bring one side of the rolled dough towards the center and press lightly. now spread again some ghee on the folded part. Fold the opposite side of the rolled dough on top of the folded part. Press lightly. again spread some ghee on this second folded part. Fold the right side and bring it towards the center. Spread some ghee on this fold too. Lastly fold the left side on top of the right fold.Sprinkle some flour on the folded paratha. Begin to roll. Add some more flour if required while rolling. Roll into a square paratha. Heat a tawa (skillet) and place the paratha on the tawa. The tawa should be medium hot. You will soon see the paratha puffing up from the base at some places. Flip the paratha when the base is ¼ cooked. Spread some ghee.  Flip again when the second side is about ½ cooked. You will see brown spots now. Spread some ghee on this side now. lip again a couple of times till you see more brown spots and the paratha is cooked evenly. Make all parathas this way. Either serve the plain paratha hot or stack them in a roti basket. take care that the edges of the paratha are cooked well. You can press the edges with spatula or spoon to do this and use enough oil or ghee to fry them. Also if you want more crisp parathas then fry them more to get more brown crisp spots. Serve the plain paratha hot with dal makhani or mango pickle or green chilli pickle or any Indian vegetable curry. ","url":"https://www.youtube.com/watch?v=47fRmufjdQ4"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbd9"},"id":8,"name":"Stuffed Paratha","recipe":"Rinse, peel and chop the veggies.Then steam or boil the veggies in a pressure cooker or steamer till they are thoroughly cooked. If you are mixing the raw vegetables with water while cooking, then do not discard the water. Some of this water can be added to the dough while kneading. Also you can add this water to make soups or dals. When the veggies cool down, then mash with a potato masher. Mash very well. Add finely chopped spinach. If you do not have spinach, then you can add other green like amaranth or fenugreek (methi). Add chopped coriander leaves, green chilies and ginger. Add cumin powder, coriander powder, red chili powder, garam masala powder, asafoetida and salt. Mix the spices and salt very well with the mashed veggie mixture. Add whole wheat flour (atta). Make a well and add oil or ghee. Bring everything together and start to knead. No need to add water while kneading. Add water only if its a must. Otherwise the dough becomes sticky.in case if the dough becomes sticky then add some more flour. Knead to a smooth dough. Pinch medium sized ball from the dough. Flatten & sprinkle some flour all over it. Gently roll to a size of a chapati or roti. Add more flour if required while rolling.","url":"https://www.youtube.com/watch?v=rYnYuBAmV-I"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbda"},"id":9,"name":"Special Fried Rice","recipe":" Using a small pat of butter, scramble some eggs in a large sauté pan, breaking them into small pieces as you go.  Then transfer the eggs to a separate plate, and set aside. Return your sauté pan to the heat, and sauté the onions, carrots, peas and garlic until soft and cooked through. Then turn the burner to high heat.  Scooch the veggies over to one side of the pan, melt the remaining butter in the other half, and add the chilled rice, soy sauce, and oyster sauce (if using).  Then stir to combine with the veggies and continue sautéing the rice, stirring every 15-20 seconds or so for 3 minutes, or until you notice the rice and veggies starting to brown slightly. Remove pan from heat. And stir in your green onions, sesame oil, and scrambled eggs. Give the rice a taste, and season with salt and pepper, plus any extra soy sauce or sesame oil if needed.Then dish it up and serve nice and warm!","url":"https://www.youtube.com/watch?v=aWArcqFI9ag&t=122s"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbdb"},"id":10,"name":"Schezuan Fried Rice","recipe":"Rinse the basmati rice, till the water runs clear of the starch. Then soak the rice in water for 30 mins. Drain and keep aside. Bring water, salt and a few drops of oil to a gentle boil.Add the drained soaked rice. Simmer on a low flame, till the rice grains are just cooked.  Strain the rice in a colander. Rinse the rice with water so that the rice grains stop cooking. Gently with your hands, move the cooked rice grains, while rinsing them with water. Drain completely. Cover and keep aside. Chop all the vegetables finely. Remember to chop the french beans very finely. They take more time to cook than other veggies. You can also blanch them first and then cook. Another option is to add the beans first and then add the other vegetables.Heat oil in a pan. Add the chopped garlic and saute for about 15 to 20 seconds. Now increase the flame to its highest, add all the vegetables including the spring onions and celery. Keep on stirring the veggies, till they start getting browned from the edges. It took me about 9 minutes for the vegetables to cook. Now add the schezwan sauce. Stir well. Add the rice in parts and keep on stirring. Stir gently as you don’t want the rice grains to break. Season with salt, pepper and vinegar. Mix and stir fry for 2 to 3 minutes tossing the rice so that the sauce coats each and every rice grain well. Check the taste and add more salt, pepper and schezwan sauce if required. Garnish with spring onion greens and Serve the schezwan fried rice hot with any Indo Chinese sauce like mushroom manchurian or gobi manchurian.","url":"https://www.youtube.com/watch?v=OUhyJPJlfS8"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbdc"},"id":11,"name":"Ghee Rice","recipe":"firstly, in a large kadai heat 1 tbsp ghee and roast 8 cashew and 2 tbsp raisins. roast the cashew to golden brown and keep aside. now in the same kadai saute 1 bay leaf, 1 inch cinnamon, 2 pods cardamom, 5 cloves and ½ tsp pepper. also, add ½ onion, 1 chilli and saute until the onions turn golden brown. now add 1 cup basmati rice (soaked 20 minutes) and roast for 1 minute without breaking rice grains. further, add 2 cup water, 1 tsp lemon juice and 1 tsp salt. stir well and get the water to a boil. cover and simmer for 20 minutes or pressure cook for 2 whistles. after 20 minutes, fluff the rice gently without breaking rice grains. add fried nuts and mix well. finally, enjoy ghee rice with kurma.","url":"https://www.youtube.com/watch?v=0fsQAbxiNdk"}
]