[
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbcf"},"id":1,"name":"Coleslaw Salad","recipe":"Make coleslaw dressing: In a small mixing bowl whisk together the mayonnaise, apple cider vinegar and honey. If needed season with a bit of salt. Pour dressing over shredded cabbage mixture: Place shredded coleslaw mix in a large bowl then pour the dressing mixture over. Toss together: Toss to evenly coat. Easy as that! Tip: I like to serve it right away while the cabbage is nice and crisp but if want it a little more tender let it rest 10 minutes in the fridge.","url":"https://www.youtube.com/watch?v=g127xdqC03E"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbd0"},"id":2,"name":"Russian Salad","recipe":"First rinse 1 medium sized carrot, 1 medium sized potato, ¼ cup french beans (chopped) and ½ cup green peas (matar) in water.In a pan or pot add enough water and boil the carrot, potato, green peas and french beans. Then drain the water. You could also microwave them till they are completely cooked. When the veggies are cooked, peel the potato and then chop them. Also chop the boiled carrots and french beans. Alternatively, you can chop the veggies first and boil them later. I usually avoid doing the latter as when we chop the veggies and then boil them, some water- soluble vitamins and minerals are lost in the process. It is better to first boil them whole and then chop them. Measure and keep all the ingredients ready for making the veg russian salad. In a bowl or vessel add ¾ cup eggless mayonnaise. Whisk with a wired whisk or spatula till the mayonnaise looks smooth. Next add the chopped carrots, potatoes, french beans and green peas.Add 1 small stick of celery (finely chopped) and salt as required.  Finally add black pepper powder (optional).Stir and mix very well.  Garnish the russian salad with some lettuce leaves and slices of tomato, cucumber or capsicum. Serve the Russian salad with your regular meals or you can also have it plain any time of the day when you are feeling hungry. ","url":"https://www.youtube.com/watch?v=948mcYdlhRk"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbd1"},"id":3,"name":"Pasta Salad","recipe":"In a large pot of salted boiling water, cook pasta until al dente, rinse under cold water and drain. Whisk together the salad spice mix and Italian dressing. In a salad bowl, combine the pasta, cherry tomatoes, bell peppers and olives. Pour dressing over salad; toss and refrigerate overnight.","url":"https://www.youtube.com/watch?v=XI8CxKOxNFk"}
]