[
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbc5"},"id":1,"name":"Babycorn Tikka","recipe":"Add a cup of curd to a muslin cloth and hang it for 30mins.Set aside.Clean baby corn. Boil water with a pinch of turmeric powder and salt.Add baby corn and parboil it.Just cook for 2 mins.Drain , trim both the edges and slit it into 2 vertically. Further slit into 2 , this is optional as my baby corns were fat I did this.Chop into small finger size pieces, collect in a bowl. Now take hung curd along with all the ingredients listed under ‘for the spice mix’.Mix well with a whisk to form a smooth thickish batter.Now take wire rack, wrap with aluminium foil and grease it with oil.Preheat oven at 200 deg C. Now each piece of baby corn in the batter,turn over all sides to coat the batter.Now carefully arrange them in the greased sheet.Now bake it in the same temperature for 15 mins and change the mode to grill and grill it for 4mins or until the edges turn slightly black.Brush with oil and turn over the pieces in between to avoid burning. As you see the edges are starting to burn, thats the right stage.You can even tawa fry baby corn but sure it will not taste the same as oven roasted ones.","url":"https://www.youtube.com/watch?v=ui9mfRlkq_s"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbc6"},"id":2,"name":"Galouti Kebab","recipe":"Marinate the minced meat in the ground ingredients for 4-5 hours.Mix together the coriander leaves, green chillies, gram flour and egg. Add to the meat and work at it for some time, almost kneading it like a dough. Shape mixture into round patties of desired size, and refrigerate for half an hour or so.Heat the ghee in a heavy-based frying pan or griddle. Fry the kebabs, browning first one side and then the other, over medium heat. Arrange them on a serving dish, sprinkle lemon juice and serve.","url":"https://www.youtube.com/watch?v=yMEhhmqYYZM"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbc7"},"id":3,"name":"Hara Bhara Kebab","recipe":"Preheat the oven for 10 minutes at 180 degrees celsius. use both the top and bottom heating rods of the oven while preheating as well as baking.  Brush some oil on top of each kabab. Place kababs in a tray which has been sprayed or greased with some oil. Place the kebabs on a tray or wired rack in the center of the oven. Bake hara bhara kabab at 180 degrees celsius for 20 to 25 minutes or till the kabab get browned from the top. You can even change the sides after 10 to 15 minutes of baking. Better to bake both the sides of hara bhara kebab.","url":"https://www.youtube.com/watch?v=wmKpmZmeArE"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbc8"},"id":4,"name":"Hariyali Kebab","recipe":"Wash the chicken breast and cut into medium size chunks. Apply salt, butter, lemon juice and red chilli powder on the chicken pieces and keep aside for 10-15 minutes. In the meantime, chop the methi leaves thinly, boil in little amount of water and drain aside. Combine the boiled methi, spinach, coriander-mint leaves, ginger, garlic and green chilies. Grind into a smooth paste. Now add curd and spices in ground paste of leaves and coat the chicken pieces very well in it. Cover the marinated chicken and keep it aside at least for 20 minutes, so that chicken gets the aroma and flavors of green paste and spices. Soak the wooden skewers in normal water for about 4-5 minutes. Apply some oil on the skewers and arrange the pieces of chicken onto the skewers. Spread some more oil on top of the chicken pieces. Preheat the oven at degrees 350F for 5 minutes and place the skewers in the oven. Leave to grill for about 15-18 minutes. Keep checking and turn the skewer sticks to cook evenly from all the sides. Grill till the kabab is well done. Remove the kabab from the skewers and arrange on the serving plate. Serve hot with lemon wedges, cabbage kachumber and spicy green chutney.","url":"https://www.youtube.com/watch?v=eRSEZfpZaa8"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbc9"},"id":5,"name":"Sheekh Kebab","recipe":"In a bowl mix together the mutton mince and the chicken mince. Mix them with your hands.Add ginger-garlic paste to it along with onion paste, red chilli powder, coriander powder, cumin powder, powdered pepper, dried mango powder, saunth, oil, cashew paste and cream. Mix nicely. Add besan (chickpea flour) and egg yolk to bind. Mix well. Add salt to taste. Mix. Cover and keep in the fridge for 1 hour. Skewer the kebabs onto oiled skewers and grill or roast till the outside is nicely browned. Baste frequently with oil while grilling. Once the kebabs are cooked, remove to a serving platter and garnish with onion rings, fresh coriander leaves and lemon wedges.","url":"https://www.youtube.com/watch?v=ov13Yr3MLCQ"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbca"},"id":6,"name":"Paneer Tikka","recipe":"Whisk the yogurt in a large bowl until smooth. I have used greek yogurt here, you can use regular yogurt just make sure to strain it for several hours until you have thick yogurt left and then use in the recipe. Add all the ingredients for marinade to the yogurt- ginger garlic paste, mustard oil, coriander powder, chaat masala, kashmiri red chili powder, garam masala, red chili powder, kasuri methi and salt. Whisk to combine everything together. Add in juice of 1 lemon along with chopped cilantro and mint. Mix well. 5- Stir in the paneer cubes, onion and bell peppers. Mix until all the paneer pieces and veggies are well coated with the marinade. Cover the bowl and refrigerate for minimum for 1 hour or up to 4 hours.  Overnight also works! After 1-2 hours, take the marinated paneer and veggies out of the refrigerator. Take a skewer and arrange paneer, onion and peppers on a skewer, alternating with each other. Make all skewers similarly. Meanwhile pre-heat oven to 450 F degrees. Make sure you pre-heat the oven for good 15-20 minutes. Arrange all the prepared skewers on a baking sheet lined with parchment paper. Spray the tikka with a oil spray. This is important so that the veggies don’t dry out. Bake at 450 F degrees for 10 minutes and then turn on the broil. Broil for 2 to 3 minutes until paneer pieces look little charred. Remove from oven, squeeze lemon juice, sprinkle chaat masala and serve with cilantro chutney. If you want the paneer to be even softer, bake at 450 F degrees for 5 minutes and then broil for 3 to 4 minutes. Don’t overcook the paneer else it will gets really tough and chewy, you want it soft.","url":"https://www.youtube.com/watch?v=hsR0JaD1TyA"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbcb"},"id":7,"name":"Thread Tofu or Baby Corn","recipe":"Heat 1 tablespoon of the vegetable oil in a stainless steel skillet over medium-high heat. Add the green beans. Cook the green beans, stirring only occasionally, until browned and shriveled, about six minutes. Add the pepper and cook about 2 minutes more. Remove veggies from pan and set aside. Heat the remaining 2 tablespoons of vegetable oil in the same pan. Add the tofu in a single layer and let it cook for 2 minutes without stirring. Then add 1 tablespoon of the tamari and use a metal spatula to unstick the tofu from the pan. (Don’t worry if some crispy parts separate from the rest of the tofu – all these crispy bits will go into your final dish and create a wonderful textural – and flavor-packed – element!) Cook for 4-5 minutes more, until nice and browned, stirring more frequently now, and continuing to use your spatula to unstick stuck pieces. urn into a bowl (I plopped mine into my cooked bean threads) and use your spatula to unstick any remaining crispy bits from the bottom of the pan and turn them into the bowl (see picture). In the same pan (which should now be relatively clean after your spatula work), heat the sesame oil. Add the ginger and cook for 1-2 minutes, then add the garlic and cook for 30 seconds to a minute more. Add the remaining tablespoon of gluten-free tamari – it will sizzle and thicken immediately. Turn the heat down to low right away and add the coconut aminos. Immediately add the tofu, bean threads, and veggies and stir to coat everything in the sauce you’ve made. Serve with your favorite chili paste.","url":"https://www.youtube.com/watch?v=ob2CYmTx9PM"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbcc"},"id":8,"name":"Paneer Satay","recipe":" Place the paneer fingers in a bowl. Add salt, soy sauce, lemon juice, garlic, ginger, brown sugar and honey and mix. Leave to marinate for one hour preferably in a refrigerator. Heat oil in a griddle or tawa. Thread the marinated paneer onto satay sticks and place on the griddle. Pour some of the excess marinade over the paneer and cook, turning the satay sticks to brown the paneer evenly on all sides. For the peanut sauce, heat the oil in a pan; add onion and sauté for a few minutes. Add ginger and garlic and continue to sauté. Add soy sauce, peanut butter and two tablespoons of water. Stir in the coconut milk, lemon juice, salt and honey. Add the fresh red chilli and remove from heat. Serve the paneer satay with the sauce.","url":"https://www.youtube.com/watch?v=EOko7yrxMFc"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbcd"},"id":9,"name":"Baby corn Satay","recipe":"To begin making the Spicy Baby corn Satay Recipe, first steam the baby corns over high heat in a steamer for about 3 to 4 minutes, until just about cooked. Once cooked firm, turn off the heat and keep aside. In a bowl mix combine all the ingredients for the marinade and make a thick paste. Add the baby corns to this and evenly coat them with the mixture. Allow the baby corns to marinate in the mixture for at least 20 minutes. Once the baby corns have marinated well, it's time to toss them in a pan, so the the corn get cooked and coated well with the marinade. Heat a skillet pan on medium high heat. Add a tablespoon of oil in the skillet and place the baby corns along with marinade into the pan and toss them in the oil and heat until all the marinade has thickened and the baby corn has cooked through.  Once done, remove the baby corn satay from the pan, insert skewers or picks through the center, place it in a platter and serve. Serve the Baby Corn Satay along with a peanut dipping sauce as an appetizer for parties.","url":"https://www.youtube.com/watch?v=JPGPL5Uw8Ss"},
    {"_id":{"$oid":"5fccfecc9a402f3438e3dbce"},"id":10,"name":"Chilly cheese balls","recipe":"Mix the maida and corn flour in water to make a smooth batter. Set aside.In a large bowl, add all the ingredients for the cheese balls. Mash with your hands such that the mixture is uniform.Grease your palm with oil and make 15-16 small sized balls with the dough.Now dip the balls in the flour batter and coat it with bread crumbs. Again dip them in the flour batter and repeat coating with bread crumbs. This will ensure that a crust is formed while frying and melted cheese doesn’t ooze out from the cheese balls.Heat oil in a pan. When heated, turn the flame to medium and fry the balls till they are light golden.Transfer them on a kitchen towel, so that excess oil is soaked out.Serve them hot with sweet chili sauce or ketchup.","url":"https://www.youtube.com/watch?v=RCbwZdg0Do4"}
]